app/controllers/school_classes_controller.rb

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "test2"], ["room_number", "test2"], ["updated_at", "2020-11-28 17:31:57.843110"], ["id", 1]]
---
  def update
    school_class = SchoolClass.update(school_class_params)